## Merge two lists

In [1]:
ll = list(range(4))
ss = list(range(5, 8))

In [2]:
ll.extend(ss)

In [3]:
ll

[0, 1, 2, 3, 5, 6, 7]

## Merge to dictionary

In [4]:
dict1 = {  'Ritika': 5, 'Sam': 7, 'John' : 10 }
# Create second dictionary
dict2 = {'Aadi': 8,'Sam': 20,'Mark' : 11 }
dict1.update(dict2)

In [5]:
dict1

{'Ritika': 5, 'Sam': 20, 'John': 10, 'Aadi': 8, 'Mark': 11}

## Numpy array concatenate

In [8]:
import numpy as np
x = np.array([[1, 2],
     [3, 4]])
np.concatenate([x, x], axis=1)

array([[1, 2, 1, 2],
       [3, 4, 3, 4]])

## Pandas objects concat

In [9]:
import pandas as pd
ser1 = pd.Series(['A', 'B', 'C'], index=[1, 2, 3])
ser2 = pd.Series(['D', 'E', 'F'], index=[4, 5, 6])
pd.concat([ser1, ser2])

1    A
2    B
3    C
4    D
5    E
6    F
dtype: object

In [34]:
x = pd.DataFrame(np.arange(12).reshape(3,4), index = [0, 1, 2], columns = list('ABCD'))
x

   A  B   C   D
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [19]:
pd.concat([x, x], axis = 1)

   A  B   C   D  A  B   C   D
0  0  1   2   3  0  1   2   3
1  4  5   6   7  4  5   6   7
2  8  9  10  11  8  9  10  11

In [21]:
pd.concat([x, x], axis = 0, ignore_index=True)

   A  B   C   D
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11
3  0  1   2   3
4  4  5   6   7
5  8  9  10  11

In [35]:
y = x.copy() ### use copy to define y unrelated with x
y.columns = list('XYZW')

In [27]:
y

   X  Y   Z   W
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [37]:
x.append(y)

//anaconda3/lib/python3.7/site-packages/pandas/core/frame.py:7138: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  sort=sort,

     A    B     C     D     W    X    Y     Z
0  0.0  1.0   2.0   3.0   NaN  NaN  NaN   NaN
1  4.0  5.0   6.0   7.0   NaN  NaN  NaN   NaN
2  8.0  9.0  10.0  11.0   NaN  NaN  NaN   NaN
0  NaN  NaN   NaN   NaN   3.0  0.0  1.0   2.0
1  NaN  NaN   NaN   NaN   7.0  4.0  5.0   6.0
2  NaN  NaN   NaN   NaN  11.0  8.0  9.0  10.0

In [39]:
z = x
x.append(z)

   A  B   C   D
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

## Pandas merge

In [40]:
df1 = pd.DataFrame({'employee': ['Bob', 'Jake', 'Lisa', 'Sue'],
                    'group': ['Accounting', 'Engineering', 'Engineering', 'HR']})
df2 = pd.DataFrame({'employee': ['Lisa', 'Bob', 'Jake', 'Sue'],
                    'hire_date': [2004, 2008, 2012, 2014]})
df1

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR

In [41]:
df2

  employee  hire_date
0     Lisa       2004
1      Bob       2008
2     Jake       2012
3      Sue       2014

In [43]:
df3 = pd.merge(df1, df2,  on='employee')
df3

  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014

In [45]:
df3 = pd.DataFrame({'name': ['Bob', 'Jake', 'Lisa', 'Sue'],
                    'salary': [70000, 80000, 120000, 90000]})
df3

   name  salary
0   Bob   70000
1  Jake   80000
2  Lisa  120000
3   Sue   90000

In [48]:
pd.merge(df1, df3, left_on="employee", right_on="name").drop('name', axis = 1)

  employee        group  salary
0      Bob   Accounting   70000
1     Jake  Engineering   80000
2     Lisa  Engineering  120000
3      Sue           HR   90000

In [50]:
df1a = df1.set_index('employee')
df2a = df2.set_index('employee')
df1a

                group
employee
Bob        Accounting
Jake      Engineering
Lisa      Engineering
Sue                HR

In [51]:
df2a

          hire_date
employee
Lisa           2004
Bob            2008
Jake           2012
Sue            2014

In [55]:
pd.merge(df1a, df2a, left_index = True, right_index = True) # merge using index

                group  hire_date
employee
Bob        Accounting       2008
Jake      Engineering       2012
Lisa      Engineering       2004
Sue                HR       2014

In [56]:
df1a.join(df2a) # join directly using index

                group  hire_date
employee
Bob        Accounting       2008
Jake      Engineering       2012
Lisa      Engineering       2004
Sue                HR       2014